Autodesk.Navisworks.Api.Plugins.ClashResultActionPluginRecord
Represents a ClashResultActionPluginRecord record in Navisworks

Autodesk.Navisworks.Api.Plugins.ClashResultActionPluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.ClashResultActionPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.ClashResultActionPluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load